export const Strings = {
  errors: {
    someError: 'Что-то пошло не так!!!',
    validateError: 'Данные не соответствуют ожидаемой модели!',
    notFound: 'Данные не найдены!',
  },
  global: {
    ok: 'Ок',
    continue: 'Продолжить',
    retry: 'Попробовать снова',
    noData: 'Нет данных',
    back: 'Назад',
  },
  user: {
    name: 'Имя',
    lastName: 'Фамилия',
    email: 'e-mail',
    allUpload: 'Список пользователей полностью загружен',
  },
  main: {
    title: 'Клуб любителей кошек Симба г. Ульяновск',
    text: [
      'Приветствуем Вас на официальном сайте Региональной фелинологической общественной  организации Клуб любителей кошек Коргоруши!',
      'Наш клуб существует с 1995 года. Клуб Kоргоруши работает по правилам международной фелинологической системы WCF. Подробно можно ознакомится на официальном сайте системы.',
      'Среди членов клуба Коргоруши - владельцы известных питомников, животные которых неоднократно являлись участниками "Best in Show", побеждали на международных выставках не только у нас в стране и СНГ, но и в дальнем зарубежье, являются чемпионами мира  своих пород.',
      'В клубе представлены различные породы кошек (Абиссинская, Бенгальская, Балинезийская, Британская короткошерстная Британская длинношерстная, Норвежская лесная,Персидская, Сомалийская, Скотиш-фолд (Шотландская вислоухая), Тайская Экзотическая короткошерстная, Курильский бобтейл, Сибирская, Мейнкун, Чаузи, Девон-рекс, Той-Боб), но особое внимание мы уделяем разведению Меконгски (или, как они назывались до утверждения породы, тайских) бобтейлов, количество которых в РФОО "Коргоруши" самое большое в России. Родоначальники племенных линий этой породы в нашем клубе были привезены из Юго-Восточной Азии.',
      'В ноябре 2003 года на Международной выставке "Содружество - Гран При Royal Canin 2003" была проведена презентация меконг-бобтейлов, а 14-15 августа 2004 года порода была утверждена на Генеральной Ассамблее WCF.',
      'Клуб "Коргоруши" длительное время был одним из организаторов выставок "Содружество"',
      'Если Вас заинтересовала работа клуба "Коргоруши", обращайтесь к нам.',
      'Президент клуба Кошачий Король',
    ]
  }
} as const;
